PROFILING_RESULTS/artillery_log.txt
Started phase 0, duration: 1s @ 12:45:52(-0300) 2021-05-18
Report @ 12:46:02(-0300) 2021-05-18
Elapsed time: 11 seconds
  Scenarios launched:  50
  Scenarios completed: 0
  Requests completed:  359
  Mean response/sec: 39.96
  Response time (msec):
    min: 581
    max: 1626
    median: 940
    p95: 1400.3
    p99: 1595.7
  Codes:
    200: 359

Report @ 12:46:12(-0300) 2021-05-18
Elapsed time: 21 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  421
  Mean response/sec: 42.83
  Response time (msec):
    min: 354
    max: 1452
    median: 906
    p95: 1317.4
    p99: 1374.9
  Codes:
    200: 421

Report @ 12:46:16(-0300) 2021-05-18
Elapsed time: 25 seconds
  Scenarios launched:  0
  Scenarios completed: 50
  Requests completed:  220
  Mean response/sec: 40.41
  Response time (msec):
    min: 352
    max: 1007
    median: 758
    p95: 970
    p99: 998.8
  Codes:
    200: 220

All virtual users finished
Summary report @ 12:46:16(-0300) 2021-05-18
  Scenarios launched:  50
  Scenarios completed: 50
  Requests completed:  1000
  Mean response/sec: 41.05
  Response time (msec):
    min: 352
    max: 1626
    median: 879
    p95: 1359
    p99: 1455.5
  Scenario counts:
    0: 50 (100%)
  Codes:
    200: 1000